Revit 2024 API
Face.IsCyclic Property
Indicates whether the underlying surface is periodic in the specified parametric direction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool this[
	int paramIdx
] { get; }
Visual Basic
Public ReadOnly Property IsCyclic ( _
	paramIdx As Integer _
) As Boolean
	Get
Visual C++
public:
property bool IsCyclic[int paramIdx] {
	bool get (int paramIdx);
}
Parameters
paramIdx
Type: System.Int32
Use 0 for U coordinates and 1 for V coordinates.
Return Value
True if the underlying surface is cyclic in the specified coordinate space; otherwise, false.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  Thrown when an incorrect coordinate dimension is supplied.
See Also
Face Class
Autodesk.Revit.DB Namespace